app/views/welcome/newCita.html.erb

SELECT "autos".* FROM "autos" WHERE "autos"."cliente_id" = ?  [["cliente_id", 1]]
SELECT "asesors".* FROM "asesors"
---
		<br>
		Placa de sus Autos: <%= select("autos", "placas", @autosCliente.collect {|p| [ p.Placa,p.id ]})%>
		<br>
		Asesor: <%= select("asesor", "all", @allAsesores.collect {|p| [ p.NombreAsesor,p.id ]})%>