app/controllers/welcome_controller.rb

SELECT  "cita".* FROM "cita" WHERE "cita"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "autos".* FROM "autos" WHERE "autos"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "asesors".* FROM "asesors" WHERE "asesors"."id" = ? LIMIT 1  [["id", 1]]
---
  def seguimiento
  	@selectedCita = Citum.find_by(:id => params[:idCita])
  	@selectedAuto = Auto.find_by(:id => @selectedCita.auto_id)
  	@selectedAsesor = Asesor.find_by(:id => @selectedCita.asesor_id)

SELECT  "clientes".* FROM "clientes" WHERE "clientes"."id" = ? LIMIT 1  [["id", 1]]
SELECT "asesors".* FROM "asesors"
---
  def newCita
  	@selectedCliente = Cliente.find_by(:id => params[:idCliente])
  	@autosCliente = @selectedCliente.Auto
  	@allAsesores = Asesor.all

SELECT "cita".* FROM "cita" WHERE "cita"."id" = ?  [["id", nil]]
---
  def checkCita
	if Citum.where(:id => params[:idCita]).blank?

SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = ?  [["id", 123]]
---
  def checkCliente
  	if Cliente.where(:id => params[:idCliente]).blank?